
#include "Head.h"
//**************************************************************************************************************************************************************************
// 喂狗，设置1000ms定时
//**************************************************************************************************************************************************************************
void WatchDogFeet(void)
{
//	if(EA)
//	{
//		EA = 0;
		WDCON |= 0x01;						// 看门狗寄存器写允许
		WDCON  = 0x72;						// 设置看门狗定时1000ms，并清除看门狗定时器及关闭写允许
//		EA = 1;	
//	}
//	else
//	{
//		WDCON |= 0x01;						// 看门狗寄存器写允许
//		WDCON  = 0x72;						// 设置看门狗定时1000ms，并清除看门狗定时器及关闭写允许
//	}
	
}
//**************************************************************************************************************************************************************************
// 关狗
//**************************************************************************************************************************************************************************
void WatchDogClose(void)
{
	WDCON |= 0x01;						// 看门狗寄存器写允许
	WDCON  = 0x70;						// 设置看门狗定时1000ms，并关闭看门狗
}
//=====================================
// 时间间隔定时器TIC初始化函数
void init_tic(void)
{
 	shijian = 1;
	if(shijian<60)							// 1分以内
	{
		TIMECON = 0x12;						// 0-255小时,秒,连续,允许中断,
		INTVAL = shijian;						// 间隔时间5,10,20,30s;1,2,5,10,20,30m
	}
	else if(shijian<3600)					// 1小时以内
	{
		TIMECON=0x22;						// 0-255小时,秒,连续,允许中断,
		INTVAL=shijian/60;					// 间隔时间5,10,20,30s;1,2,5,10,20,30m
	}
	else									// 1形式至65535/3600=18.2小时
	{
		TIMECON=0x32;						// 0-255小时,秒,连续,允许中断,
		INTVAL=shijian/3600;				// 间隔时间5,10,20,30s;1,2,5,10,20,30m
	}

	TIMECON=TIMECON|0x03;					// 使能时钟,启动TIC
	IEIP2=IEIP2|0x04;						// 允许TIC中断 ETI置1 Written by User to Enable “1” or Disable “0” Time Interval Counter Interrupt.
}   
//=====================================
// 时间间隔定时器TIC禁用
void dis_tic(void)
{
	TIMECON = TIMECON&0xFC;			// 停止TIC
	IEIP2 = IEIP2&0xFB;				// 禁止TIC中断
}
//定时器1初始化=====================================
//用于通讯分包
void Init_T1(void)							//断包时间为3.5个字长
{
	TMOD |= 0x10;								//定时器1工作在16位模式下
}
//定时器1复位=====================================
void Timer1_ReSet(void)	  						//0(19200),1(38400),2(57600),3(115200)
{

	TH1 = 0xC9;//( char ) (( 65536 - (int)( SYSCLK / 12 * 10)) / 256 ) ;
	TL1 = 0x62;//( char ) (( 65536 - (int)( SYSCLK / 12 * 10)) % 256 ) ;
	ET1   = 1 ;		// Enable TIMER0 Interrupt.
	TR1   = 1;		// 定时器0运行控制位
}
// 定时器T3初始化函数(用T3为串口波特率9600bps发生器)
void Init_T3(void)
{
//	SCON=0xC0;								// 串口11b可变,
	SCON = 0x40;								// 串口10b可变,2007

	T3CON = 0x85;
#ifdef ad834
	T3FD = 0x12;
#endif
#ifdef ad832
	T3FD = 0x2D;	
#endif
	RI = 0;
	TI = 0;
	REN = 1;
//	ES=1;
}
//定时器2初始化=====================================
//用于通讯分包
//void Init_T2(void)							//断包时间为3.5个字长
//{
//	TMOD |= 0x10;								//定时器0工作在16位模式下
//}
//定时器0复位=====================================
//void Timer2_ReSet(void)	  						//0(19200),1(38400),2(57600),3(115200)
//{
//	T2DATA = ( 65536 - (int)( SYSCLK / 12 * 4));
//	ET2   = 1 ;		// Enable TIMER0 Interrupt.
//	TR2   = 1;		// 定时器0运行控制位
//}